#Область ПрограмныйИнтерфейс
Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	
	Если ДанныеЭлемента.Свойство("message") Тогда
		
		Сообщение = ДанныеЭлемента.message;
		
		Если Не Сообщение.Свойство("from") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Сообщение.Свойство("text") Тогда
			Возврат;
		КонецЕсли;
				
		Отправитель = Сообщение.from.id;
		Текст = Сообщение.text;
		Если Текст = "Собака" Тогда
		Соединение = Новый HTTPСоединение("api.thedogapi.com",,,,,, Новый ЗащищенноеСоединениеOpenSSL);
		АдресКарт = "/v1/images/search?api_key=DEMO_KEY";
		Запрос = Новый HTTPЗапрос(АдресКарт);
	    Ответ = Соединение.Получить(Запрос);
	    
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка вызова сервиса";
	КонецЕсли;
	
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеОтвета = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	
	СсылкаНаФото = ДанныеОтвета[0]["url"]; 
 
	СсылкаБезПротокола = Сред(СсылкаНаФото, 9);
	
	НомерПервогоСлеша = СтрНайти(СсылкаБезПротокола, "/");
	
	АдресСервера = Лев(СсылкаБезПротокола, НомерПервогоСлеша - 1);
	АдресРесурсаНаСервере = Сред(СсылкаБезПротокола, НомерПервогоСлеша);
	АдресСервера= "cdn2.thedogapi.com";

	Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурсаНаСервере);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка скачивания фото";
	КонецЕсли;
	ДанныеФото = Ответ.ПолучитьТелоКакДвоичныеДанные();	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетныеЗаписиТелеграм.Код
		|ИЗ
		|	Справочник.УчетныеЗаписиТелеграм КАК УчетныеЗаписиТелеграм";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИнтеграцияТелеграм.ОтправитьКартинку(
			Выборка.Код, 
			ДанныеФото);
		
			КонецЦикла;    
		Иначе               
			Ответ1 = "Напиши Собака";
			ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Ответ1);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти