
&НаКлиенте
Процедура ПолучитьФото(Команда)
	
	ПолучитьФотоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьФотоНаСервере()
	
	Соединение = Новый HTTPСоединение("api.nasa.gov",,,,,, Новый ЗащищенноеСоединениеOpenSSL);
	
	Токен = "DEMO_KEY";
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ВызватьИсключение "Заполните токен для работы с сервисом";
	КонецЕсли;
	
	ШаблонЗаголовка = "Client-ID %1";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", СтрШаблон(ШаблонЗаголовка, Токен));
	
	АдресРесурса = СтрШаблон("/planetary/apod?api_key=%1", Токен);		
	
	Запрос = Новый HTTPЗапрос(АдресРесурса);
		
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка вызова сервиса";
	КонецЕсли;
		
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();                   
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеОтвета = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	
	СсылкаНаФото = ДанныеОтвета["url"];
	ОписаниеФото = ДанныеОтвета["explanation"];
	
	ПолучитьДанныеФото(СсылкаНаФото);
	

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеФото(СсылкаНаФото)
	
	СсылкаБезПротокола = Сред(СсылкаНаФото, 9);
	
	НомерПервогоСлеша = СтрНайти(СсылкаБезПротокола, "/");
	
	АдресСервера = Лев(СсылкаБезПротокола, НомерПервогоСлеша - 1);
	АдресРесурсаНаСервере = Сред(СсылкаБезПротокола, НомерПервогоСлеша);
	
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL);		
	Запрос = Новый HTTPЗапрос(АдресРесурсаНаСервере);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка скачивания фото";
	КонецЕсли;

	ДанныеФото = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	АдресФото = ПоместитьВоВременноеХранилище(ДанныеФото, УникальныйИдентификатор); 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетныеЗаписиТелеграм.Код
		|ИЗ
		|	Справочник.УчетныеЗаписиТелеграм КАК УчетныеЗаписиТелеграм";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИнтеграцияТелеграм.ОтправитьКартинку(
			Выборка.Код, 
			ПолучитьИзВременногоХранилища(АдресФото));
		
	КонецЦикла;
	
КонецПроцедуры

