#Область ПрограммныйИнтерфейс

// Выполняет обработку сообщения телеграм в выбранном режиме.
// 
// Параметры:
//  ДанныеЭлемента - Структура - Сообщение, полученное из телеграм
Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	
	Если ДанныеЭлемента.Свойство("message") Тогда
		
		Сообщение = ДанныеЭлемента.message;
		
		Если Не Сообщение.Свойство("from") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Сообщение.Свойство("text") Тогда
			Возврат;
		КонецЕсли;
		
		Отправитель = Сообщение.from.id;
		Текст = Сообщение.text;
		Если Текст = "Лис" Тогда
		Соединение = Новый HTTPСоединение("randomfox.ca",,,,,, Новый ЗащищенноеСоединениеOpenSSL);
	
	АдресРесурса = "/floof/";		
	
	Запрос = Новый HTTPЗапрос(АдресРесурса);
		
	Ответ = Соединение.Получить(Запрос);
	    
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка вызова сервиса";
	КонецЕсли;
	
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеОтвета = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	
	СсылкаНаФото = ДанныеОтвета["image"]; 
	ОписаниеФото = "Милые лисятки :3";  
	СсылкаБезПротокола = Сред(СсылкаНаФото, 8);
	
	НомерПервогоСлеша = СтрНайти(СсылкаБезПротокола, "/");
	
	АдресСервера = Лев(СсылкаБезПротокола, НомерПервогоСлеша - 1);
	АдресРесурсаНаСервере = Сред(СсылкаБезПротокола, НомерПервогоСлеша);
	
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL);		
	Запрос = Новый HTTPЗапрос(АдресРесурсаНаСервере);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка скачивания фото";
	КонецЕсли;
	ДанныеФото = Ответ.ПолучитьТелоКакДвоичныеДанные();	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетныеЗаписиТелеграм.Код
		|ИЗ
		|	Справочник.УчетныеЗаписиТелеграм КАК УчетныеЗаписиТелеграм";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИнтеграцияТелеграм.ОтправитьКартинку(
			Выборка.Код, 
			ДанныеФото, 
			ОписаниеФото);
		
			КонецЦикла;    
		Иначе               
			Ответ1 = "Напиши ""Лис""";
			ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Ответ1);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти