
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Приветствие = Константы.ПриветствиеТестаСРасшифровкой.Получить();
	Заключение = Константы.ОбщиеРекомендацииТестаСРасшифровкой.Получить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриветствиеПриИзменении(Элемент)
	ЗаписатьПриветствие(Приветствие);
КонецПроцедуры

&НаКлиенте
Процедура ЗаключениеПриИзменении(Элемент)
	ЗаписатьЗаключение(Заключение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьПриветствие(Приветствие)
	Константы.ПриветствиеТестаСРасшифровкой.Установить(Приветствие);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьЗаключение(Заключение)
	Константы.ОбщиеРекомендацииТестаСРасшифровкой.Установить(Заключение);
КонецПроцедуры

#КонецОбласти


