
&НаСервере
Процедура КомандаПолучитьПогодуНаСервере()
	Соединение = Новый HTTPСоединение("api.weather.yandex.ru",,,,,, Новый ЗащищенноеСоединениеOpenSSL);
						
	Токен = Константы.ТокенСервисаПогодыАрх.Получить();
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ВызватьИсключение "Заполните токен для работы с сервисом";
	КонецЕсли;
	
	
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Yandex-API-Key", "5aebe8ba-7640-4255-99d4-c141eb0f8b0f");
	
	Запрос = Новый HTTPЗапрос("v2/informers?lat=64.5401&lon=40.5433", Заголовки);
	
	Ответ = Соединение.Получить(Запрос);
	
		
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеОтвета = ПрочитатьJSON(Чтение); 
	ТипJSON = Чтение.ТипТекущегоЗначения;
	
	Если ТипJSON = ТипЗначенияJSON.Null Тогда
		Значение = Чтение.ТекущееЗначение;
	КонецЕсли;
	Чтение.Закрыть();     
		
	ТемператуАрх = ДанныеОтвета.info.url;
	НеделяАрх = ДанныеОтвета.fact.temp;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетныеЗаписиТелеграм.Код
		|ИЗ
		|	Справочник.УчетныеЗаписиТелеграм КАК УчетныеЗаписиТелеграм";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИнтеграцияТелеграм.ОтправитьСообщение(
			Выборка.Код, 
			ТемператуАрх,
			НеделяАрх);
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьПогоду(Команда)
	КомандаПолучитьПогодуНаСервере();      	
КонецПроцедуры
