
#Область ПрограммныйИнтерфейс

Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	
	Если ДанныеЭлемента.Свойство("message") Тогда
		
		Сообщение = ДанныеЭлемента.message;
		
		Если Не Сообщение.Свойство("from") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Сообщение.Свойство("text") Тогда
			Возврат;
		КонецЕсли;
		
		Отправитель = Сообщение.from.id;
		Текст = Сообщение.text;
		
		Шаблон = "Вы написали: %1
		 |Бот разработан Струнин Михаилом";
		 
		Ответ = СтрШаблон(Шаблон, Текст);
		
		
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Ответ);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
