
#Область ПрограммныйИнтерфейс

// Обработчик элемента очереди в режиме работы бота - Эхо-бот
// 
// Параметры:
//  ДанныеЭлемента - Структура
Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	
	Если ДанныеЭлемента.Свойство("message") Тогда
		
		Сообщение = ДанныеЭлемента.message;
		
		Если Не Сообщение.Свойство("from") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Сообщение.Свойство("text") Тогда
			Возврат;
		КонецЕсли;
		
		Отправитель = Сообщение.from.id;
		Текст = Сообщение.text;
		
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Текст);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
