#Область ПрограммныйИнтерфейс

Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	
	Если ДанныеЭлемента.Свойство("message") Тогда
		
		Сообщение = ДанныеЭлемента.message;
		
		Если Не Сообщение.Свойство("from") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Сообщение.Свойство("text") Тогда
			Возврат;
		КонецЕсли;
		
		Отправитель = Сообщение.from.id;
		Текст = Сообщение.text;    
			
	КонецЕсли;


	Соединение = Новый HTTPСоединение("api.nasa.gov",,,,,, Новый ЗащищенноеСоединениеOpenSSL); 
	
	Токен = Константы.ТокенСервисаПоискаФото.Получить();
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ВызватьИсключение "Заполните токен для работы с сервисом";
	КонецЕсли;

	
	АдресРесурса = СтрШаблон("/planetary/apod?api_key=%1&date=%2", Токен, Формат(Текст, "ДФ=yyyy-MM-dd"));		
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка вызова сервиса";
	КонецЕсли;
		
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();                   
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеОтвета = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	
	СсылкаНаФото = ДанныеОтвета["url"];
	ОписаниеФото = ДанныеОтвета["explanation"]; 
	
	
	СсылкаБезПротокола = Сред(СсылкаНаФото, 9);
	
	НомерПервогоСлеша = СтрНайти(СсылкаБезПротокола, "/");
	
	АдресСервера = Лев(СсылкаБезПротокола, НомерПервогоСлеша - 1);
	АдресРесурсаНаСервере = Сред(СсылкаБезПротокола, НомерПервогоСлеша);
	
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL);		
	Запрос = Новый HTTPЗапрос(АдресРесурсаНаСервере);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка скачивания фото";
	КонецЕсли;
		
	ДанныеФото = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	АдресФото = ПоместитьВоВременноеХранилище(ДанныеФото);
			
	Ответ = (ПолучитьИзВременногоХранилища(АдресФото));
	
	ИнтеграцияТелеграм.ОтправитьКартинку(Отправитель, Ответ);
	ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ОписаниеФото);
	
КонецПроцедуры

#КонецОбласти

