#Область ПрограмныйИнтерфейс
Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	
	Если ДанныеЭлемента.Свойство("message") Тогда
		
		Сообщение = ДанныеЭлемента.message;
		
		Если Не Сообщение.Свойство("from") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Сообщение.Свойство("text") Тогда
			Возврат;
		КонецЕсли;
		
		// Вы написали: [ТекстСообщения]
		// Бот разработан Матвеем Серегиным (САФУ)
		
		Отправитель = Сообщение.from.id;
		Текст = Сообщение.text;
		Если Текст = "Марс" Тогда
		Соединение = Новый HTTPСоединение("api.nasa.gov",,,,,, Новый ЗащищенноеСоединениеOpenSSL);
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		Ключ=ГСЧ.СлучайноеЧисло(1, 399);
		АдресКарт = "/mars-photos/api/v1/rovers/curiosity/photos?sol=" + Ключ +"&api_key=o8RxdmoeEgb0phsxlutenWBysB2hJ2cCU52jV49f";
		Запрос = Новый HTTPЗапрос(АдресКарт);
	    Ответ = Соединение.Получить(Запрос);
	    
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка вызова сервиса";
	КонецЕсли;
	
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеОтвета = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	
	СсылкаНаФото = ДанныеОтвета["photos"][0]["img_src"]; 
	ОписаниеФото = ДанныеОтвета["photos"][0]["earth_date"];  
	СсылкаБезПротокола = Сред(СсылкаНаФото, 8);
	
	НомерПервогоСлеша = СтрНайти(СсылкаБезПротокола, "/");
	
	АдресСервера = Лев(СсылкаБезПротокола, НомерПервогоСлеша - 1);
	АдресРесурсаНаСервере = Сред(СсылкаБезПротокола, НомерПервогоСлеша);
	АдресСервера= "mars.nasa.gov";

	Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурсаНаСервере);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка скачивания фото";
	КонецЕсли;
	ДанныеФото = Ответ.ПолучитьТелоКакДвоичныеДанные();	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетныеЗаписиТелеграм.Код
		|ИЗ
		|	Справочник.УчетныеЗаписиТелеграм КАК УчетныеЗаписиТелеграм";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИнтеграцияТелеграм.ОтправитьКартинку(
			Выборка.Код, 
			ДанныеФото, 
			ОписаниеФото);
		
			КонецЦикла;    
		Иначе               
			Ответ1 = "Напиши Марс";
			ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Ответ1);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти