
&НаКлиенте
Процедура ПолучитьФото(Команда)
	
	ПолучитьФотоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьФотоНаСервере()
	
	Соединение = Новый HTTPСоединение("api.thedogapi.com",,,,,, Новый ЗащищенноеСоединениеOpenSSL);  
	Запрос = Новый HTTPЗапрос("/v1/images/search?api_key=DEMO_KEY");
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка вызова сервиса";
	КонецЕсли;
	
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеОтвета = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	
	СсылкаНаФото = ДанныеОтвета[0]["url"]; 
	
	ПолучитьДанныеФото(СсылкаНаФото);
	

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеФото(СсылкаНаФото)
	
	СсылкаБезПротокола = Сред(СсылкаНаФото, 9);
	
	НомерПервогоСлеша = СтрНайти(СсылкаБезПротокола, "/");
	
	АдресСервера = Лев(СсылкаБезПротокола, НомерПервогоСлеша - 1);
	АдресРесурсаНаСервере = Сред(СсылкаБезПротокола, НомерПервогоСлеша);
	АдресСервера= "cdn2.thedogapi.com";

	Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурсаНаСервере);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка скачивания фото";
	КонецЕсли;
	
	ДанныеФото = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	АдресФото = ПоместитьВоВременноеХранилище(ДанныеФото);	
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьФотоВсемПодписчикам(ОписаниеФото)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетныеЗаписиТелеграм.Код
		|ИЗ
		|	Справочник.УчетныеЗаписиТелеграм КАК УчетныеЗаписиТелеграм";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИнтеграцияТелеграм.ОтправитьКартинку(
			Выборка.Код, 
			ПолучитьИзВременногоХранилища(АдресФото));
		
	КонецЦикла;
	
КонецПроцедуры
