
#Область ПрограммныйИнтерфейс

// Объект в строку JSON.
// 
// Параметры:
//  Объект - Произвольный
// 
// Возвращаемое значение:
//  Строка - Строка в формате JSON
Функция ОбъектВСтрокуJSON(Объект) Экспорт
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Объект);
	Возврат Запись.Закрыть();	
	
КонецФункции

// Строку JSONВОбъект.
// 
// Параметры:
//  Строка - Строка - Строка в формате JSON
// 
// Возвращаемое значение:
//  Произвольный - Объект, полученный в результате десериализации
Функция СтрокуJSONВОбъект(Строка) Экспорт
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Строка);
	Объект = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат Объект;
	
КонецФункции

#КонецОбласти
