#Область ПрограммныйИнтерфейс

Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	
	Если ДанныеЭлемента.Свойство("message") Тогда
		Сообщение = ДанныеЭлемента.message;
		Отправитель = Сообщение.from.id;
		Прокси = WSСсылки.DailyInfo.СоздатьWSПрокси(
	                                         "http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
		
		ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(
	                                        "http://web.cbr.ru/").Получить("GetCursOnDate");
		WSПараметр	   = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
		WSПараметр.On_Date	= ТекущаяДатаСеанса();
		КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
		Текст = "";
		Кекс = 0;
		Для Каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл
			ВалютаВТексте = ВРег(Сообщение.text);
			ВалютаВЭлементе = ВРег(СокрЛП(Элемент.Vname));
			Если ВалютаВТексте = ВалютаВЭлементе или Сообщение.text = Строка(Элемент.Vcode)
				или Сообщение.text = Строка(Элемент.VChCode) Тогда
					Текст = "";
					Текст = Текст + " " + Строка(Элемент.Vname) + Символы.ПС;
					Текст = Текст + "Номинал:  " + Строка(Элемент.Vnom) + Символы.ПС;
					Текст = Текст + "Цифровой код:  " + Строка(Элемент.Vcode) + Символы.ПС;
					Текст = Текст + "Символьный Код:  " + Строка(Элемент.VChCode) + Символы.ПС;
					Текст = Текст + "Курс: " + Строка(Элемент.Vcurs) + Символы.ПС;
					Если Число(Элемент.Vnom) > 1 Тогда 
						Текст = Текст + "Курс единицы валюты: " + Число(Элемент.Vcurs) / Число(Элемент.Vnom); 
					КонецЕсли;
					ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Текст);
					Кекс = Кекс + 1;
			КонецЕсли;	
		КонецЦикла;
		Если Кекс = 0 Тогда
				Текст = "Введите код валюты (цифровой или символьный)";
				ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Текст);
		КонецЕсли;
		
		
		Если Не Сообщение.Свойство("from") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Сообщение.Свойство("text") Тогда
			Возврат;
		КонецЕсли; 
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

	

